# Börsenkurse kompilieren

In [1]:
import pandas as pd

In [2]:
import glob

## Dateien laden

**Liste der Dateien erstellen**

In [3]:
path = 'Bluechips/'

In [4]:
filenames = glob.glob(path + '*.csv')

In [5]:
filenames[0]

'Bluechips/ZURN.SW.csv'

**Liste von Dataframes mit den Dateien**

In [6]:
dfs = []

In [7]:
dfs = [pd.read_csv(filename) for filename in filenames]

## Daten aggregieren

**Spalte mit Company Name hinzufügen**

In [8]:
for df, filename in zip(dfs, filenames):
    df['Ticker'] = filename
    df['Ticker'] = df['Ticker'].str.extract(path + '(.+).SW.csv')

In [9]:
dfs[0].head(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,2012-09-03,228.600006,230.100006,227.699997,229.399994,127.941551,268447,ZURN
1,2012-09-04,229.300003,229.600006,226.899994,228.100006,127.216522,342534,ZURN

**Daten aneinanderreihen**

In [10]:
df_all = pd.concat(dfs, ignore_index=True)

In [11]:
df_all.head(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
0,2012-09-03,228.600006,230.100006,227.699997,229.399994,127.941551,268447,ZURN
1,2012-09-04,229.300003,229.600006,226.899994,228.100006,127.216522,342534,ZURN

In [12]:
df_all.tail(2)

,Date,Open,High,Low,Close,Adj Close,Volume,Ticker
48546,2022-09-01,43.000000,43.060001,42.560001,42.740002,42.740002,1205118,HOLN
48547,2022-09-02,44.009998,45.049999,43.520000,45.049999,45.049999,2389007,HOLN

**Name für Ticker hinzufügen**

In [13]:
df_names = pd.read_csv('company_names_2022.csv')

In [14]:
df_names.head(2)

   Company Ticker
0  ABB LTD   ABBN
1    ALCON    ALC

In [15]:
df_all_m = df_all.merge(df_names, how='left', on='Ticker')

**Spalte Close auswählen und Pivot**

In [16]:
df_pivoted = df_all_m.pivot(index='Date', columns='Company', values='Close')

In [17]:
df_pivoted.head(2)

Company,ABB LTD,ALCON,CS GROUP,GEBERIT,GIVAUDAN,HOLCIM,LOGITECH,LONZA,NESTLE,NOVARTIS,PARTNERS GROUP,RICHEMONT,ROCHE,SGS,SIKA,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,UBS GROUP,ZURICH INSURANCE
Date,,,,,,,,,,,,,,,,,,,,
2012-09-03,16.709999,NaN,16.836145,204.100006,907.0,56.095238,8.850,40.840107,59.950001,49.945457,183.300003,60.000000,174.800003,1932.0,30.766666,109.099998,60.299999,385.200012,10.73,229.399994
2012-09-04,16.480000,NaN,16.534031,200.199997,896.0,55.333332,9.095,40.376961,59.150002,49.459263,189.000000,59.150002,173.000000,1904.0,30.183332,109.300003,60.150002,385.799988,10.56,228.100006

In [18]:
df_pivoted.rename_axis(None, inplace=True)

In [19]:
df_pivoted.rename_axis(None, inplace=True)

In [20]:
df_pivoted.head(2)

Company,ABB LTD,ALCON,CS GROUP,GEBERIT,GIVAUDAN,HOLCIM,LOGITECH,LONZA,NESTLE,NOVARTIS,PARTNERS GROUP,RICHEMONT,ROCHE,SGS,SIKA,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,UBS GROUP,ZURICH INSURANCE
2012-09-03,16.709999,NaN,16.836145,204.100006,907.0,56.095238,8.850,40.840107,59.950001,49.945457,183.300003,60.000000,174.800003,1932.0,30.766666,109.099998,60.299999,385.200012,10.73,229.399994
2012-09-04,16.480000,NaN,16.534031,200.199997,896.0,55.333332,9.095,40.376961,59.150002,49.459263,189.000000,59.150002,173.000000,1904.0,30.183332,109.300003,60.150002,385.799988,10.56,228.100006

In [21]:
df_pivoted.tail(2)

Company,ABB LTD,ALCON,CS GROUP,GEBERIT,GIVAUDAN,HOLCIM,LOGITECH,LONZA,NESTLE,NOVARTIS,PARTNERS GROUP,RICHEMONT,ROCHE,SGS,SIKA,SWISS LIFE HOLDING,SWISS RE,SWISSCOM,UBS GROUP,ZURICH INSURANCE
2022-09-01,26.48,64.180000,4.862,438.100006,3036.0,42.740002,47.770000,510.000000,112.959999,78.559998,902.599976,104.949997,312.799988,2110.0,212.199997,499.000000,76.18,506.399994,14.970,423.000000
2022-09-02,27.41,66.019997,5.160,454.299988,3114.0,45.049999,48.970001,526.200012,113.419998,79.449997,940.200012,107.550003,318.700012,2171.0,222.800003,515.200012,79.00,508.200012,15.595,434.100006

## Daten exportieren

In [22]:
df_pivoted.to_csv('smi_members.csv')